MultipleRefereneFrame_MRF/constant/MRFProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      MRFProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

zone1
{
    cellZone    rotFluid;
    active      yes;
    

    // Fixed patches (by default they 'move' with the MRF zone)
    //nonRotatingPatches ();
    nonRotatingPatches (MRFOuter1 MRFOuter2);

    origin    (0 0 0);
    axis      (0 0 1);
    omega     -7.01E-03;   //15000 deg/s or 2500 rpm
}

// ************************************************************************* //
