MultipleRefereneFrame_MRF/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
	//preconditioner	DIC;
        tolerance       1e-8;
        relTol          0.1;
        smoother        FDIC;
    }

    pFinal
    {
    	$p;
    }

    U
    {
        solver          PBiCGStab;
	preconditioner	DILU;
        tolerance       1e-8;
        relTol          0.1;
    }
    
    UFinal
    {
    	$U;
    }
}

"(SIMPLE|PIMPLE)"
{
    consistent			yes;
    nCorrectors			2;
    nOuterCorrectors		1;
    nNonOrthogonalCorrectors 	1;
    pRefCell        		0;
    pRefValue       		0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.9;
    }
}


// ************************************************************************* //
